IMPORTING PACKAGES

In [6]:
import pandas as pd

READING THE XYZ FILE DIRECTLY FROM THE FOLDER AND PRINTING IT

In [7]:
d1=pd.read_csv('before ref_full_surface.xyz',delimiter=',',header=None)
d1.head()

          0          1      2
0  695118.5  5537394.5  40.54
1  695409.5  5537397.5 -57.41
2  695410.5  5537397.5 -56.99
3  695408.5  5537398.5 -58.15
4  695409.5  5537398.5 -57.60

ELIMINATING NOISE DATA FROM THE DATA BY MARKING THE NOISE AS 'None'

In [8]:
d1[d1<0]=None

DROPING THE NONE ROWS

In [9]:
d1=d1.dropna()

CONVERTING THE ELIPSOIDAL HEIGHT TO CHART DATUM

In [10]:
d1['CD']=d1[2]-53.48+2.91             # elipsoidal height to odn = -53.48
                                       # ODN TO CD =+2.91
d1.head()

          0          1      2     CD
0  695118.5  5537394.5  40.54 -10.03
6  695018.5  5537413.5  54.83   4.26
7  695019.5  5537413.5  54.67   4.10
8  695020.5  5537413.5  54.33   3.76
9  695021.5  5537413.5  54.24   3.67

APPLYING THE SYSTAMATIC CORRECTION TO THE EASTING AND NORTHING IN TERMS OF ETRS89

In [12]:
d1['E']=d1[0]+0.02          # +0.02 CORRECTION
d1['N']=d1[1]-0.66          # -0.660 CORRECTION
d1=d1.drop(columns=[0,1,2])     #dropping the ocessed columns
d1.head()

      CD          E           N
0 -10.03  695118.52  5537393.84
6   4.26  695018.52  5537412.84
7   4.10  695019.52  5537412.84
8   3.76  695020.52  5537412.84
9   3.67  695021.52  5537412.84

REARRANGING THE COLUMNS FOR FORMATTING PURPOSE

In [14]:
d1= d1[['E','N','CD']] ##the way we rearranged it
d1.head()

           E           N     CD
0  695118.52  5537393.84 -10.03
6  695018.52  5537412.84   4.26
7  695019.52  5537412.84   4.10
8  695020.52  5537412.84   3.76
9  695021.52  5537412.84   3.67

CONVERTING THE FILE TO .csv AND .txt AND SAVING IN THE FOLDER

In [17]:
d1.to_csv('usv_correct_fulldata.csv',index=False)
d1.to_csv('usv_correct_fulldata.txt',index=False)

READING THE FILE HAVING THE REFRACTION CORRECTED WATER DURFACE

In [21]:
d2=pd.read_csv('water surface ref corrected.xyz',delimiter=',',header=None)

In [22]:
d2.head()

          0          1      2
0  695173.5  5537437.5  50.61
1  695173.5  5537438.5  50.54
2  695173.5  5537439.5  50.74
3  695173.5  5537440.5  50.57
4  695173.5  5537441.5  50.37

ELIMINATING NOISE DATA FROM THE DATA BY MARKING THE NOISE AS 'None'

In [23]:
d2[d2<0]=None

DROPING THE NONE ROWS

In [24]:
d2=d2.dropna()

APPLYING THE SYSTAMATIC CORRECTION TO THE EASTING AND NORTHING IN TERMS OF ETRS89

In [25]:
d2['E']=d2[0]+0.02
d2['N']=d2[1]-0.66
d2['CD']=d2[2]-53.48+2.91
d2.head()

          0          1      2          E           N            CD
0  695173.5  5537437.5  50.61  695173.52  5537436.84  4.000000e-02
1  695173.5  5537438.5  50.54  695173.52  5537437.84 -3.000000e-02
2  695173.5  5537439.5  50.74  695173.52  5537438.84  1.700000e-01
3  695173.5  5537440.5  50.57  695173.52  5537439.84  3.552714e-15
4  695173.5  5537441.5  50.37  695173.52  5537440.84 -2.000000e-01

DROPPING THE COLUMNS FOR FORMATTING PURPOSE

In [26]:
d2=d2.drop(columns=[0,1,2])
d2.head()

           E           N            CD
0  695173.52  5537436.84  4.000000e-02
1  695173.52  5537437.84 -3.000000e-02
2  695173.52  5537438.84  1.700000e-01
3  695173.52  5537439.84  3.552714e-15
4  695173.52  5537440.84 -2.000000e-01

In [29]:
d2.to_csv('usv_correct_waterdata.csv',index=False)
d2.to_csv('usv_correct_waterdata.txt',index=False)